iRidium-Mobile/BUS77-SDK/Application/STM32/STM32F103C8T6/Example/Template/Firmware/iRidiumDevice/CDevice.cpp
//////////////////////////////////////////////////////////////////////////
// class CDevice
//////////////////////////////////////////////////////////////////////////
// Включения
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"
#include "Main.h"
#include "stdlib.h"

// Common
#include "CCanPort.h"
#include "UTF8.h"

// MCUCommon
#include "CFlashNVRAM.h"

// ChipCommon
#include "InputOutput.h"
#include "CommonCAN.h"

// DeviceCommon
#include "CDeviceIndicator.h"
#include "FLASHMemoryMap.h"
#include "NVRAM.h"

// iRidium device
#include "CDevice.h"

// iRidium protocol
#include "IridiumBytes.h"
#include "IridiumCRC16.h"
#include "CIridiumStreebog.h"

#define MAX_DEVICE_CHANNELS            4           // Максимальное количество каналов управления
#define MAX_DEVICE_TAGS                2           // Максимальное количество каналов обратной связи

#define MAX_VARIABLES                  16          // Максимальное количество глобальных переменных на канал управления

#define FIRMWARE_READ_STREAM_ID        1           // Идентификатор потока чтения прошивки
#define FIRMWARE_WRITE_STREAM_ID       2           // Идентификатор потока записи прошивки

#define MAX_SAVE_CHANNELS              1           // Максимальное количество сохраняемых каналов
#define START_SAVE_CHANNEL_INDEX       3           // Начальный индекс сохраняемого канала управления
#define END_SAVE_CHANNEL_INDEX         4           // Конечный индекс сохраняемого канаоа управления

#define MAX_SAVE_TAGS                  MAX_DEVICE_TAGS   // Максимальное количество дискретных каналов

#define MAX_INPUTS                     0           // Максимальное количество дискретных каналов

///////////////////////////////////////////////////////////////////////////////
// Информация о каналах управления
///////////////////////////////////////////////////////////////////////////////
// Идентификаторы каналов управления
enum eChannels
{
   CHANNEL_NAME = 1,                               // Имя устройства
   CHANNEL_PIN,                                    // Пин код устройства
   CHANNEL_REBOOT,                                 // Перезагрузка устройства
   CHANNEL_TEST,                                   // Тестовый канал
};

// Имена каналов управления
const char g_pszChannelName[]    = "Имя устройства";
const char g_pszChannelPIN[]     = "PIN код";
const char g_pszChannelReboot[]  = "Перезагрузка устройства";
const char g_pszChannelTest[]    = "Тестовый канал";

// Текстовое описание каналов обратной связи
const char g_pszChannelDescriptionName[]  = "32 байта(16 сим. латин(кирил)ицей)";
const char g_pszChannelDescriptionPIN[]   = "Персональное идентификационное число";

// Массив с описанием канала управления
const device_channel_t g_aDeviceChannels[MAX_DEVICE_CHANNELS] =
{
   {  CHANNEL_NAME,     (char*)g_pszChannelName,   IVT_STRING8,   0,       32,         1,       (char*)g_pszChannelDescriptionName, CF_W,          0              },
   {  CHANNEL_PIN,      (char*)g_pszChannelPIN,    IVT_U32,       0,       0xFFFFFFFF, 1,       (char*)g_pszChannelDescriptionPIN,  CF_W | CF_R,   0              },
   {  CHANNEL_REBOOT,   (char*)g_pszChannelReboot, IVT_BOOL,      false,   true,       false,   (char*)g_pszChannelReboot,          CF_W,          0              },
   {  CHANNEL_TEST,     (char*)g_pszChannelTest,   IVT_U8,        0,       100,        1,       (char*)g_pszChannelTest,            CF_W,          MAX_VARIABLES  },
};

///////////////////////////////////////////////////////////////////////////////
// Информация о каналах обратной связи
///////////////////////////////////////////////////////////////////////////////
// Идентификаторы каналов обратной связи
enum eTags
{
   TAG_ERROR = 1,                                  // Код ошибки
   TAG_TEST,                                       // Тестовый канал
};

// Имена каналов обратной связи
const char g_pszTagError[]    = "Код ошибки";
const char g_pszTagTest[]     = "Тестовые каналы";

// Текстовое описание каналов обратной связи
const char g_pszTagDescriptionError[]  = "Код ошибки";
const char g_pszTagDescriptionTest[]   = "Тестовые каналы";

// Массив с описанием канала управления
const device_tag_t g_aDeviceTags[MAX_DEVICE_TAGS] =
{
   {  TAG_ERROR,  (char*)g_pszTagError,   IVT_U8,     0,          255,              1,          (char*)g_pszTagDescriptionError, CF_W  },
   {  TAG_TEST,   (char*)g_pszTagTest,    IVT_U8,     0,          255,              1,          (char*)g_pszTagDescriptionTest,  CF_W  },
};

CDevice                 g_Device;                  // Данные объекта

// Указатель на данные HAL CAN порта
extern CAN_HandleTypeDef   hcan;
/*
static CanTxMsgTypeDef  g_aCanTxMessage;           // Структура для отправляемого сообщения
static CanRxMsgTypeDef  g_aCanRxMessage;           // Структура для принимаемого сообщения
*/
CFlashNVRAM             g_NVRAM;

// Параметры CAN порта для сборки и разборки пакетов
CCANPort                g_ExtCAN;                  // Данные внешнего CAN порта
can_frame_t             g_aCANInBuffer[256];       // Массив для приема и сборки CAN пакетов
can_frame_t             g_aCANOutBuffer[33*8];     // Массив для отправки CAN пакетов
u16                     g_u16CANID = 0;            // Идентификатор CAN

CDeviceIndicator        g_Indicator;               // Индикация

// Индексы кнопок
enum eInputs
{
   INPUT_1_INDEX = 0,                              // Дискретный вход 1 управляется замыканием на "землю"
   INPUT_2_INDEX,                                  // Дискретный вход 2 управляется замыканием на "землю"
   INPUT_3_INDEX,                                  // Дискретный вход 3 управляется замыканием на "землю"
   INPUT_4_INDEX,                                  // Дискретный вход 4 управляется замыканием на "землю"
   ONBOARD_BUTTON_INDEX,                           // Набортная кнопка
};

// Режим работы кнопки
enum eButtonMode 
{
   BUTTON_MODE_OFF = 0,                            // Канал выключен
   BUTTON_MODE_DIRECT,                             // Прямое управление (Нажатие - 1, Отжатие - 0)
   BUTTON_MODE_TRIGGER,                            // Триггерное переключение (изменение фронта изменение значения)
};

// Структура для хранения состояния бинарного входа
typedef struct input_data_s
{
   u8             m_u8Mode;                        // Режим работы дискретного входа
   u16            m_u16Delay;                      // Время долгого удержания
   struct
   {
      unsigned m_bMode        :  1;                // Режим работы триггера
      unsigned m_bOldValue    :  1;                // Предедущее значение канала
      unsigned m_bPressValue  :  1;                // Текущее тригерное значение короткого нажатия
      unsigned m_bHoldValue   :  1;                // Текущее тригерное значение длинного удержания
      unsigned m_bSendLong    :  1;                // Было отправлена датаграмма долгого удержания
   } m_Flags;
} input_data_t;

#if MAX_INPUTS != 0

