iRidium-Mobile/BUS77-SDK/Application/STM32/STM32F103C8T6/Example/Template/Firmware/iRidiumDevice/CDevice.cpp
// Данные для настройки бинарных каналов
input_data_t   g_aInputData[MAX_INPUTS];

#endif

/////////////////////////////////////////////////////////////////////////////////////
// Энергонезависимая память // переменные, которые нужно сохранить, дабавляем сюда //
/////////////////////////////////////////////////////////////////////////////////////
typedef struct nvram_device_s
{
   // Обшая структура данных (для загрузчика и прошивки)
   nvram_common_t m_Common;
   // Список битов признаков владения переменными
   u8                m_aOwners[((sizeof(g_aDeviceTags) / sizeof(g_aDeviceTags[0])) + 7) / 8];
   // Массив глобальных переменных связанных с каналами управления
   u16               m_aChannelVariables[MAX_SAVE_CHANNELS][MAX_VARIABLES];
   // Массив глобальных переменных связанных с каналами обратной связи
   u16               m_aTagVariables[sizeof(g_aDeviceTags) / sizeof(g_aDeviceTags[0])];

} nvram_device_t;

// Данные устройства
nvram_device_t   g_NVRAMData;

///////////////////////////////////////////////////////////////////////////////
// Информация об устройстве
///////////////////////////////////////////////////////////////////////////////
const char g_pszProducer[]    = "iRidium";
const char g_pszModelName[]   = "iRidium firmware";

char g_pszHWID[STREEBOG_HASH_256_BYTES + 1];       // Аппаратный идентификатор шеснадцатеричное представление 128 битного числа + 1 байт

char g_szTemp[128];                                // Промежуточный буфер

// Информация об устройстве
const iridium_device_info_t g_DeviceInfo =
{
   IRIDIUM_GROUP_TYPE_ACTUATOR,
   g_NVRAMData.m_Common.m_szDeviceName,
   (char*)g_pszProducer,
   (char*)g_pszModelName,
   (char*)g_pszHWID,
   DCT_MICROCONTROLLER,
   PT_ARM,
   OST_NONE,
   IRIDIUM_DEVICE_FLAG_FIRMWARE | IRIDIUM_DEVICE_FLAG_ACTUATOR,
   0,
   { 1, 0 },
   0,
   0
};

/**
   Получение размера значения
   на входе    :  in_u8Type   - тип значения
                  in_rValue   
   на выходе   :  размер значения
*/
static size_t GetValueSize(u8 in_u8Type, universal_value_t& in_rValue)
{
   size_t l_stResult = 1;
   
   switch(in_u8Type)
   {
      case IVT_NONE:
      case IVT_BOOL:
         break;
      case IVT_U8:
         if(in_rValue.m_u8Value)
            l_stResult += 1;
         break;
      case IVT_S8:
         if(in_rValue.m_s8Value)
            l_stResult += 1;
         break;
      case IVT_U16:
         if(in_rValue.m_u16Value)
            l_stResult += 2;
      case IVT_S16:
         if(in_rValue.m_s16Value)
            l_stResult += 2;
         break;
      case IVT_U32:
         if(in_rValue.m_u32Value)
            l_stResult += 4;
         break;
      case IVT_S32:
         if(in_rValue.m_s32Value)
            l_stResult += 4;
         break;
      case IVT_F32:
         if(in_rValue.m_f32Value != 0.0f)
            l_stResult += 4;
         break;
      case IVT_U64:
         if(in_rValue.m_u64Value)
            l_stResult += 8;
         break;
      case IVT_S64:
         if(in_rValue.m_s64Value)
            l_stResult += 8;
         break;
      case IVT_F64:
         if(in_rValue.m_f64Value != 0.0)
            l_stResult += 8;
         break;
      case IVT_STRING8:
      case IVT_ARRAY_U8:
         if(in_rValue.m_Array.m_stSize)
            l_stResult += in_rValue.m_Array.m_stSize;
         break;
      case IVT_TIME:
         if(in_rValue.m_Time.m_u8Flags)
            l_stResult += 8;
         break;
      
      default:
         l_stResult = 0;
         break;
   }
   return l_stResult;
}

/**
   Получение указателя на порт по хэндлеру CAN порта
   на входе    :  in_pCanHandle  - указатель на хэндлер порта
   на выходе   :  указатель на данные порта
*//*
CCANPort* GetCANPort(CAN_HandleTypeDef* in_pCanHandle)
{
   CCANPort* l_pResult = NULL;

   // Проверка на нужный порт
   if(in_pCanHandle->Instance == CAN1)
      l_pResult = &g_ExtCAN;
   
   return l_pResult;
}*/

/**
   Блокирование доступа к CAN порту
   на входе    :  in_pCanHandle  - указатель на хэндлер порта
   на выходе   :  *
*//*
void LockCANPort(CAN_HandleTypeDef* in_pCanHandle)
{
   // Проверка на нужный порт
   if(in_pCanHandle->Instance == CAN1)
   {
      // Выключение прерываний CAN 1 на время сдвига буфера во избежании потери данных
      HAL_NVIC_DisableIRQ(CAN1_RX1_IRQn);
      HAL_NVIC_DisableIRQ(CAN1_RX0_IRQn);
   }
}*/

/**
   Блокирование доступа к CAN порту
   на входе    :  in_pCanHandle  - указатель на хэндлер порта
   на выходе   :  *
*//*
void UnLockCANPort(CAN_HandleTypeDef* in_pCanHandle)
{
   // Проверка на нужный порт
   if(in_pCanHandle->Instance == CAN1)
   {
      // Включение прерываний CAN 1
      HAL_NVIC_EnableIRQ(CAN1_RX1_IRQn);
      HAL_NVIC_EnableIRQ(CAN1_RX0_IRQn);
   }
}*/

/**
   Отправка прерывания приема пакета с CAN
   на входе    :  in_pCanHandle - указатель на структуру CAN
   на выходе   :  *
*//*
void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef* in_pCanHandle)
{
   can_frame_t l_Frame;

   // Получение указателя на CAN порт
   CCANPort* l_pPort = GetCANPort(in_pCanHandle);
   if(l_pPort)
   {
      // Извлечение полезной информации
      l_Frame.m_u32ExtID   = in_pCanHandle->pRxMsg->ExtId;
      l_Frame.m_u8Size     = in_pCanHandle->pRxMsg->DLC;

      // Скопируем полезную нагрузку
      memcpy(l_Frame.m_aData, in_pCanHandle->pRxMsg->Data, l_Frame.m_u8Size);

      // Добавление полученого фрейма в буфер
      l_pPort->AddFrame(&l_Frame);

      // Включим прерыване обратно
      HAL_CAN_Receive_IT(in_pCanHandle, CAN_FIFO0);
   }
}*/

/////////////////////////////////////////////////////////////////////////////////////////////////
//// Работа с шиной
/////////////////////////////////////////////////////////////////////////////////////////////////

/**
   Инициализация шины
   на входе    :  *
   на выходе   :  *
   примечание  :  микроконтроллер stm32f205vgt5 имеет два CAN порта. При этом CAN1 это master, а CAN2 это slave
                  это означает что CAN1 и CAN2 имеют блок фильтров один на двоих, то есть от 0 до 13 это фильтры
                  для CAN1, а фильтры от 14 по 27 это фильтры для CAN2
*//*
void BUS_Init()
{
   // Настройка внешней шины
   hcan.pRxMsg = &g_aCanRxMessage;
   hcan.pTxMsg = &g_aCanTxMessage;

   // Установка фильтра CAN1, прием всех сообщений
   CAN_FilterConfTypeDef CAN_FilterInitStructure;
   CAN_FilterInitStructure.FilterIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterIdLow = 0x0000;
   CAN_FilterInitStructure.FilterMaskIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterMaskIdLow = 0x0000;
   CAN_FilterInitStructure.FilterFIFOAssignment = CAN_FIFO0;
   CAN_FilterInitStructure.FilterNumber = 0;
   CAN_FilterInitStructure.FilterMode = CAN_FILTERMODE_IDMASK;
   CAN_FilterInitStructure.FilterScale = CAN_FILTERSCALE_32BIT;
   CAN_FilterInitStructure.FilterActivation = ENABLE;
   CAN_FilterInitStructure.BankNumber = 14;                 // Важно заполнить это поле
   HAL_CAN_ConfigFilter(&hcan, &CAN_FilterInitStructure);

   HAL_CAN_Receive_IT(&hcan, CAN_FIFO0);

   g_ExtCAN.SetCANID(0);
   g_ExtCAN.SetTID(0x00);
   g_ExtCAN.SetAddress(0);
   g_ExtCAN.SetInBuffer(g_aCANInBuffer, sizeof(g_aCANInBuffer));
   g_ExtCAN.SetOutBuffer(g_aCANOutBuffer, sizeof(g_aCANOutBuffer));
}*/

/**
   Инициализация фильтров шины
   на входе    :  in_u16CanID    - идентификатор CAN шины
                  in_u8Address   - адрес внешней шины
   на выходе   :  *
   примечание  :  параметры фильтра
                  [               3 байт ][               2 байт ][               2 байт ][               2 байт ]
                   31 30 29 28 27 26 25 24 23 22 21 20 19 18 17 16 15 14 13 12 11 10  9  8  7  6  5  4  3  2  1  0
                  [X][X][X][I][I][I][I][I][I][I][I][I][I][I][I][I][I][I][I][T][T][T][B][A][A][A][A][A][A][A][A][E]
                  где   :
                  X  - Резерв, должно быть равно 0
                  I  - Идентификатор CAN устройства
                  T  - Идентификатор транзакции
                  B  - Признак широковещательного фрейма (0 - адресный фрейм, 1 - широковещательный фрейм)
                  A  - Адрес кому предназначен фрейм, если признак широковещательного фрейма равен 1, значение должно быть равно 0
                  E  - Признак замыкающего фрейма
*//*
void BUS_SetFilter(u16 in_u16CanID, u8 in_u8Address)
{
   // Установка идентификатора
   g_ExtCAN.SetCANID(in_u16CanID);
   g_ExtCAN.SetAddress(in_u8Address);
   
