iRidium-Mobile/BUS77-SDK/Application/STM32/STM32F103C8T6/Example/Template/Firmware/iRidiumDevice/CDevice.cpp
   // Получение текущего PIN кода
   u32 l_u32PIN = g_NVRAMData.m_Common.m_u32PIN;

   // Проверка наличия PIN кода, если PIN кода нет, то проверка всегда дает положительный результат
   if(l_u32PIN)
   {
      switch(in_eType)
      {
         // Проверка возможности изменения значения локального адреса
         case IRIDIUM_OPERATION_TEST_PIN:
            l_s8Result = (l_u32PIN == in_u32PIN);
            break;

         // Чтение/запись канала управления
         case IRIDIUM_OPERATION_READ_CHANNEL:
         case IRIDIUM_OPERATION_WRITE_CHANNEL:
         {
            l_s8Result = 1;
            l_stIndex = GetChannelIndex(*(u32*)in_pData);
            if(l_stIndex != ~0)
            {
               l_s8Result = 1;
               // Проверка направления
               if(in_eType == IRIDIUM_OPERATION_READ_CHANNEL)
               {
                  // Проверка возможно ли чтение из канала управления
                  if(g_aDeviceChannels[l_stIndex].m_u8Flags & CF_R && l_u32PIN != in_u32PIN)
                     l_s8Result = 0;
               } else
               {
                  // Проверка возможна ли запись в канал управления
                  if(g_aDeviceChannels[l_stIndex].m_u8Flags & CF_W && l_u32PIN != in_u32PIN)
                     l_s8Result = 0;
               }
            }
            break;
         }
         // Чтение/запись потока
         case IRIDIUM_OPERATION_READ_STREAM:
         case IRIDIUM_OPERATION_WRITE_STREAM:
            l_s8Result = 1;
            break;
      }
   } else
      l_s8Result = 1;

   return l_s8Result;
}

/**
   Получение информации об устройстве
   на входе    :  out_rInfo   - ссылка на структуру куда надо поместить данные об устройстве
   на выходе   :  *
*/
bool CDevice::GetSearchInfo(iridium_search_info_t& out_rInfo)
{
   // Заполнение информации об устройстве
   out_rInfo.m_u8Group  = IRIDIUM_GROUP_TYPE_ACTUATOR;
   out_rInfo.m_pszHWID  = (char*)g_pszHWID;
   return true;
}

/**
   Получение информации об устройстве
   на входе    :  out_rInfo   - ссылка на структуру куда надо поместить данные об устройстве
   на выходе   :  *
*/
bool CDevice::GetDeviceInfo(iridium_device_info_t& out_rInfo)
{
   bool l_bResult = true;
   // Копирование информации об устройстве
   memcpy(&out_rInfo, &g_DeviceInfo, sizeof(iridium_device_info_t));
   // Информация о каналах
   out_rInfo.m_u32Channels = GetChannels();
   out_rInfo.m_u32Tags = GetTags();
   return l_bResult;
}

/**
   Установка значения переменой
   на входе    :  in_u16VariableID  - идентификатор глобальной переменной
                  in_u8Type         - тип значения
                  in_rValue         - ссылка на данные значения
                  in_u8Flags        - список флагов
   на выходе   :  *
*/
void CDevice::SetVariable(u16 in_u16VariableID, u8 in_u8Type, universal_value_t& in_rValue, u8 in_u8Flags)
{
#if MAX_SAVE_CHANNELS != 0
   // Проверка параметров
   if(in_u16VariableID)
   {
      // Пройдемся по всем каналам
      for(u8 i = 0; i < MAX_SAVE_CHANNELS; i++)
      {
         for(u8 j = 0; j < MAX_VARIABLES; j++)
         {
            // Если есть связанная глобальная переменная, вызов изменения значения переменной
            if(g_NVRAMData.m_aChannelVariables[i][j] == in_u16VariableID)
               SetChannelValue(g_aDeviceChannels[START_SAVE_CHANNEL_INDEX + i].m_u32ID, in_u8Type, in_rValue, in_u8Flags & IRIDIUM_FLAGS_END);
         }
      }
   }
#endif
}

/**
   Получение значения переменной
   на входе    :  in_u16VariableID - идентификатор переменной
                  out_rType        - ссылка куда нужно поместить тип переменной
                  out_rValue       - ссылка куда нужно поместить данные переменной
   на выходе   :  успешность
*/
bool CDevice::GetVariable(u16 in_u16VariableID, u8& out_rType, universal_value_t& out_rValue)
{
   bool l_bResult = false;
   // Проверка входных параметров
   if(in_u16VariableID)
   {
      for(u8 i = 0; i < MAX_DEVICE_TAGS; i++)
      {
         // Вычисление индекса и маски
         u8 l_u8Index = i >> 3;
         u8 l_u8Mask = 1 << (i & 0x7);
         // Проверка владеет ли устройство переменной
         if((g_NVRAMData.m_aOwners[l_u8Index] & l_u8Mask) && g_NVRAMData.m_aTagVariables[i] == in_u16VariableID)
         {
            // Получение значения тега
            if(GetTagValue(g_aDeviceTags[i].m_u32ID, out_rType, out_rValue))
               l_bResult = true;
            break;
         }
      }
   }
   return l_bResult;
}

/**
   Получение количества каналов обратной связи на устройстве
   на входе    :  *
   на выходе   :  количество каналов обратной связи
*/
size_t CDevice::GetTags()
{
   return MAX_DEVICE_TAGS;
}

/**
   Получение индекса по идентификатору канала обратной связи
   на входе    :  in_u32TagID - идентификатор канала обратной связи
   на выходе   :  == -1 - идентификатор не найден
                  != -1 - индекс канала обратной связи
*/
size_t CDevice::GetTagIndex(u32 in_u32TagID)
{
   size_t l_stResult = ~0;
   
   // Обход таблицы каналов обратной связи
   for(size_t i = 0; i < MAX_DEVICE_TAGS; i++)
   {
      // Поиск идентификтора в таблице
      if(g_aDeviceTags[i].m_u32ID != in_u32TagID)
         continue;
      // Канал обратной связи найден
      l_stResult = i;
      break;
   }
   return l_stResult;
}

/**
   Получение данных тега, по индексу
   на входе    :  in_stIndex  - индекс тега
                  out_rInfo   - ссылка на структуру куда нужно поместить данные
                  in_stSize   - размер структуры, в байтах, которую нужно заполнить
   на выходе   :  размер данных
*/
size_t CDevice::GetTagData(size_t in_stIndex, iridium_tag_info_t& out_rInfo, size_t in_stSize)
{
   u8 l_u8Result = 0;

   // Подготовка структуры к заполнению
   memset(&out_rInfo, 0, in_stSize);
   
   // Проверка индекса канала
   if(in_stIndex < MAX_DEVICE_TAGS)
   {
      // Копирование описания канала обратной связи в обучную память
      const device_tag_t* l_pTag = &g_aDeviceTags[in_stIndex];
      // Копирование данных
      out_rInfo.m_u32ID    = l_pTag->m_u32ID;
      out_rInfo.m_pszName  = l_pTag->m_pszName;
      out_rInfo.m_u8Type   = l_pTag->m_u8Type;
      
      // Получение значения канала обратной связи
      if(GetTagValue(out_rInfo.m_u32ID, out_rInfo.m_u8Type, out_rInfo.m_Value))
      {
         // Получение размера данных канала
         l_u8Result = GetValueSize(out_rInfo.m_u8Type, out_rInfo.m_Value);
         // Добавление размера имени (4 байта на идентификатор плюс размер имени и 1 байт на 0 в конце строки)
         l_u8Result += (4 + strlen(out_rInfo.m_pszName) + 1);
      }
   }
   return l_u8Result;
}

/**
   Получение описания канала обратной связи, по идентификатору
   на входе    :  in_u32TagID       - идентификатор канала обратной связи
                  out_rDescription  - ссылка на структуру куда нужно поместить описание канала обратной связи
   на выходе   :  успешность получения данных тега
*/
bool CDevice::GetTagDescription(u32 in_u32TagID, iridium_tag_description_t& out_rDescription)
{
   bool l_bResult = false;
   
