iRidium-Mobile/BUS77-SDK/Application/STM32/STM32F103C8T6/Example/Template/Firmware/iRidiumDevice/CDevice.cpp
   // Поиск канала управления в таблице
   size_t l_stIndex = GetTagIndex(in_u32TagID);
   if(l_stIndex != ~0)
   {
      // Получение индекса и маски в массиве хранения владения
      u8 l_u8Index = l_stIndex >> 3;
      u8 l_u8Mask = 1 << (l_stIndex & 0x7);
      
      // Копирование данных в обычную память
      const device_tag_t* l_pTag = &g_aDeviceTags[l_stIndex];
      // Копируем данные описания канала управления
      out_rDescription.m_ID.m_u8Type = l_pTag->m_u8Type;
      out_rDescription.m_ID.m_Min.m_u64Value = l_pTag->m_u64Min;
      out_rDescription.m_ID.m_Max.m_u64Value = l_pTag->m_u64Max;
      out_rDescription.m_ID.m_Step.m_u64Value = l_pTag->m_u64Step;
      out_rDescription.m_ID.m_pszDescription = l_pTag->m_pszDesc;
      
      // Получение флага владения
      out_rDescription.m_Flags.m_bOwner = (0 != (g_NVRAMData.m_aOwners[l_u8Index] & l_u8Mask));
      // Получение переменной
      out_rDescription.m_u16Variable = g_NVRAMData.m_aTagVariables[l_stIndex];
      l_bResult = true;
   }
   return l_bResult;
}

/**
   Установка каналу обратной связи глобальной переменной
   на входе    :  in_u32TagID      - идентификатор тега
                  in_bOwner        - признак владения
                  in_u16Variable   - идентификатор переменной
   на выходе   :  *
*/
bool CDevice::LinkTagAndVariable(u32 in_u32TagID, bool in_bOwner, u16 in_u16Variable)
{
   bool l_bResult = false;
   size_t l_stIndex = GetTagIndex(in_u32TagID);
   if(l_stIndex != ~0)
   {
      u8 l_u8Index = l_stIndex >> 3;
      u8 l_u8Mask = 1 << (l_stIndex & 0x7);
      // Запись глобальной переменной в энергонезависимую память
      g_NVRAMData.m_aTagVariables[l_stIndex] = in_u16Variable;
      // Выставим флаг владения
      if(in_bOwner)
         g_NVRAMData.m_aOwners[l_u8Index] |= l_u8Mask;
      else
         g_NVRAMData.m_aOwners[l_u8Index] &= ~l_u8Mask;
      // Отметим что нужно записать данные в энергонезависимую память
      g_NVRAM.Save();
      l_bResult = true;
   }
   return l_bResult;
}

/**
   Установка значения канала обратной связи
   на входе    :  in_u32TagID - идентификатор канала обратной связи
                  in_u8Type   - тип значения канала управления
                  in_rValue   - ссылка на значение канала управления
                  in_u8Flags  - список флагов
   на выходе   :  успешность установки значения канала управления
*/
bool CDevice::SetTagValue(u32 in_u32TagID, u8 in_u8Type, universal_value_t& in_rValue, u8 in_u8Flags)
{
   bool l_bResult = false;
   // Поиск канала управления в таблице
   size_t l_stIndex = GetTagIndex(in_u32TagID);
   if(l_stIndex != ~0)
   {
      // Отправка значения в канал
      ChangeVariable(g_NVRAMData.m_aTagVariables[l_stIndex], in_u8Type, in_rValue);
      l_bResult = true;
   }
   return l_bResult;
}

/**
   Получение количества каналов управления на устройстве
   на входе    :  *
   на выходе   :  количество каналов управления
*/
size_t CDevice::GetChannels()
{
   return sizeof(g_aDeviceChannels) / sizeof(g_aDeviceChannels[0]);
}

/**
   Получение индекса по идентификатору канала управления
   на входе    :  in_u32ChannelID   - идентификатор канала управления
   на выходе   :  == -1 - идентификатор не найден
                  != -1 - индекс канала управления
*/
size_t CDevice::GetChannelIndex(u32 in_u32ChannelID)
{
   size_t l_stResult = ~0;

   // Обход таблицы каналов управления
   for(size_t i = 0; i < sizeof(g_aDeviceChannels) / sizeof(g_aDeviceChannels[0]); i++)
   {
      // Поиск идентификтора в таблице
      if(g_aDeviceChannels[i].m_u32ID != in_u32ChannelID)
         continue;
      // Канал управления найден
      l_stResult = i;
      break;
   }

   return l_stResult;
}

/**
   Получение данных канала, по индексу
   на входе    :  in_stIndex  - индекс канала
                  out_rInfo   - ссылка на структуру куда нужно поместить данные
   на выходе   :  размер данных
*/
size_t CDevice::GetChannelData(size_t in_stIndex, iridium_channel_info_t& out_rInfo)
{
   size_t l_stResult = 0;
   // Подготовка структуры к заполнению
   memset(&out_rInfo, 0, sizeof(iridium_channel_info_t));
   // Копирование описания канала
   if(in_stIndex < sizeof(g_aDeviceChannels) / sizeof(g_aDeviceChannels[0]))
   {
      // Перенос из флеша в обычную память
      const device_channel_t* l_Channel = &g_aDeviceChannels[in_stIndex];
      
      // Копирование параметров
      out_rInfo.m_u32ID    = l_Channel->m_u32ID;
      out_rInfo.m_pszName  = l_Channel->m_pszName;
      out_rInfo.m_u8Type   = l_Channel->m_u8Type;

      // Получение значения канала
      if(GetChannelValue(out_rInfo.m_u32ID, out_rInfo.m_u8Type, out_rInfo.m_Value))
      {
         // Вычисление размера структуры (4 байта на идентификатор плюс длинна имени плюс 1 байт на конец строки)
         l_stResult = 4 + strlen(out_rInfo.m_pszName) + 1;
      }
   }

   return l_stResult;
}

/**
   Получение описания канала управления, по идентификатору
   на входе    :  in_u32ChannelID   - идентификатор канала управления
                  out_rDescription  - ссылка на структуру куда нужно поместить описание канала управления
   на выходе   :  успешность
*/
bool CDevice::GetChannelDescription(u32 in_u32ChannelID, iridium_channel_description_t& out_rDescription)
{   
   bool l_bResult = false;
   device_channel_t l_Channel;
   // Поиск канала обратной связи в таблице
   size_t l_stChannel = GetChannelIndex(in_u32ChannelID);
   if(l_stChannel != ~0)
   {
      // Копируем данные описания канала
      memcpy(&l_Channel, &g_aDeviceChannels[l_stChannel], sizeof(device_channel_t));

      // Заполнение параметров
      out_rDescription.m_ID.m_u8Type            = l_Channel.m_u8Type;
      out_rDescription.m_ID.m_Min.m_u64Value    = l_Channel.m_u64Min;
      out_rDescription.m_ID.m_Max.m_u64Value    = l_Channel.m_u64Max;
      out_rDescription.m_ID.m_Step.m_u64Value   = l_Channel.m_u64Step;
      out_rDescription.m_ID.m_pszDescription    = l_Channel.m_pszDesc;
      out_rDescription.m_Flags.m_bWritePassword = (0 != (l_Channel.m_u8Flags & CF_W));
      out_rDescription.m_Flags.m_bReadPassword  = (0 != (l_Channel.m_u8Flags & CF_R));
      out_rDescription.m_u8MaxVariables         = l_Channel.m_u8MaxVariables;

      out_rDescription.m_u8Variables = 0;
      out_rDescription.m_pVariables = NULL;

      // Если номер канала больше чем начальный сохраняемый канал
      if(l_stChannel >= START_SAVE_CHANNEL_INDEX)
      {
         l_stChannel -= START_SAVE_CHANNEL_INDEX;
         
         // Если номер канала меньше чем максимальный номер сохраняемого канала
         if(l_stChannel < MAX_SAVE_CHANNELS)
         {
            out_rDescription.m_u8Variables = MAX_VARIABLES;
            out_rDescription.m_pVariables = g_NVRAMData.m_aChannelVariables[l_stChannel];
         }
      }
      l_bResult = true;
   }
   return l_bResult;
}

/**
   Установка каналу глобальной переменной
   на входе    :  in_u32ChannelID  - идентификатор канала
                  in_u8Variables   - колличество переменных
                  in_pVariables    - указатель на список идентификаторов глобальных переменных
   на выходе   :  успешность установки
*/
bool CDevice::LinkChannelAndVariable(u32 in_u32ChannelID, u8 in_u8Variables, u16* in_pVariables)
{
   bool l_bResult = false;

   // Проверка входных параметров
   size_t l_stIndex = GetChannelIndex(in_u32ChannelID);
   if(l_stIndex != ~0)
   {
      // Если номер линкуемого канала больше чем начальный сохраняемый канал
      if(l_stIndex >= START_SAVE_CHANNEL_INDEX)
      {
         l_stIndex -= START_SAVE_CHANNEL_INDEX;
         
         // Если номер линкуемого канала меньше чем максимальный номер сохраняемого канала
         if(l_stIndex < MAX_SAVE_CHANNELS)
         {
            // Проверка количества переменных
            if(in_u8Variables > MAX_VARIABLES)
               in_u8Variables = MAX_VARIABLES;
            
            // Запись списка глобальных переменных в энергонезависимую память
            for(u8 i = 0; i < MAX_VARIABLES; i++)
               g_NVRAMData.m_aChannelVariables[l_stIndex][i] = (i < in_u8Variables ? in_pVariables[i] : 0);
            g_NVRAM.Save();
            l_bResult = true;
         }
      }
   }

   return l_bResult;
}

/**
   Установка значения канала управления
   на входе    :  in_u32ChannelID   - идентификатор канала управления
                  in_u8Type         - тип значения канала управления
                  in_rValue         - ссылка на значение канала управления
                  in_u8Flags        - список флагов
   на выходе   :  успешность установки значения канала управления
*/
bool CDevice::SetChannelValue(u32 in_u32ChannelID, u8 in_u8Type, universal_value_t& in_rValue, u8 in_u8Flags)
{
   bool l_bResult = false;
   
   switch(in_u32ChannelID)
   {
   // Изменение имени устройства
   case CHANNEL_NAME:
      if(in_u8Type == IVT_STRING8 && in_rValue.m_Array.m_stSize)
      {
         // Сохраним новое имя устройства
         size_t l_stMax = sizeof(g_NVRAMData.m_Common.m_szDeviceName);
         size_t l_stSize = (in_rValue.m_Array.m_stSize > l_stMax) ? l_stMax : in_rValue.m_Array.m_stSize;
         memcpy(g_NVRAMData.m_Common.m_szDeviceName, in_rValue.m_Array.m_pPtr, l_stSize);
         // Корректировка имени
         //SetValidEndByUTF8(g_szDeviceName, l_stSize, MAX_DEVICE_NAME_SIZE);
         l_bResult = true;
      }
      break;
      
   // Изменение PIN кода
   case CHANNEL_PIN: 
      if(in_u8Type == IVT_U32)
      {
         // Сохраним новое значение PIN
         g_NVRAMData.m_Common.m_u32PIN = in_rValue.m_u32Value;
         l_bResult = true;
      }
      break;

   // Изменение Test
   case CHANNEL_TEST: 
      if(in_u8Type == IVT_U8)
      {
         // Сохраним новое значение PIN
         //g_u8Test = in_rValue.m_u8Value;
         // Генерация изменения значения 
         size_t l_stIndex = GetTagIndex(TAG_TEST);
         if(l_stIndex != ~0)
            SendSetVariableRequest(g_NVRAMData.m_aTagVariables[l_stIndex], in_u8Type, in_rValue);
         l_bResult = true;
      }
      break;
  }
  return l_bResult;
}

/**
   Обработчик получения запроса на открытие потока
   на входе    :  in_pszName  - имя потока
                  in_eMode    - режим открытия потока
   на выходе   :  идентификатор открытого потока, если поток не был открыт возвражаемый результат равен 0
*/
u8 CDevice::StreamOpen(const char* in_pszName, eIridiumStreamMode in_eMode)
{
   u8 l_u8Result = 0;

   // Проверка имени запрашиваемого потока
   if(in_pszName && !strcmp(in_pszName, FIRMWARE_NAME))
   {
      if(in_eMode == IRIDIUM_STREAM_MODE_WRITE)
      {
         // Запишем в энергонезависимую память состояние загрузки прошивки
         g_NVRAMData.m_Common.m_u8Mode = BOOTLOADER_MODE_DOWNLOAD;
         // Запись адреса
         g_NVRAMData.m_Common.m_u16FirmwareAddress = GetSrcAddress();
         // Запись идентификатора транзакции
         g_NVRAMData.m_Common.m_u16FirmwareTID = m_InMH.m_u16TID;
         g_NVRAM.Save();

         // Осуществим переход в загрузчик через сброс контроллера
         Reboot();
      }
   }

   return l_u8Result;
}

/**
   Обработчик получения ответа на запрос открытия потока
   на входе    :  in_pszName     - имя потока
                  in_eMode       - режим открытия потока
                  in_u8StreamID  - идентификатор потока
   на выходе   :  *
*/
void CDevice::StreamOpenResult(const char* in_pszName, eIridiumStreamMode in_eMode, u8 in_u8StreamID)
{
}

/**
   Обработчик получения запроса передачи данных блока
   на входе    :  in_u8StreamID  - идентификатор потока
                  in_u8BlockID   - идентификатор блока
                  in_stSize      - размер данных блока
                  in_pBuffer     - указатель на буфер с данными блока
   на выходе   :  количество обработанных данных
*/
size_t CDevice::StreamBlock(u8 in_u8StreamID, u8 in_u8BlockID, size_t in_stSize, const void* in_pBuffer)
{
   return in_stSize;
}

/**
   Обработчик получения ответа на запрос передачи данных блока
   на входе    :  in_u8StreamID  - идентификатор потока
                  in_u8BlockID   - идентификатор блока
                  in_stSize      - количество обработанных данных
   на выходе   :  *
*/
void CDevice::StreamBlockResult(u8 in_u8StreamID, u8 in_u8BlockID, size_t in_stSize)
{
}

/**
   Обработчик закрытия потока
   на входе    :  in_u8StreamID  - идентификатор потока
   на выходе   :  *
*/
void CDevice::StreamClose(u8 in_u8StreamID)
{
}

/**
   Получение Smart API информации
   на входе    :  out_rBuffer - ссылка на указатель куда нужно указатель на данные Smart API
                  out_rSize   - ссылка на переменную куда нужно поместить размер данных Smart API
   на выход    :  успешность получения данных
*/
bool CDevice::GetSmartAPI(void*& out_rBuffer, size_t& out_rSize)
{
   out_rBuffer = NULL;//&g_SmartAPI;
   out_rSize   = 0;//sizeof(g_SmartAPI);
   return true;
}

/**
   Инициализация устройства
   на входе    :  *
   на выходе   :  *
*/
void CDevice::Setup()
{
   iridium_search_info_t l_Search;
  
