iRidium-Mobile/BUS77-SDK/Application/STM32/STM32F103C8T6/Example/Template/Firmware/iRidiumDevice/CDevice.cpp
   // Чтение текущего состояния
   if(g_NVRAMData.m_Common.m_u8FirmwareID != EXAMPLE_ID)
   {
      // Сброс PIN кода
      g_NVRAMData.m_Common.m_u32PIN = 0;
      // Сброс флагов владения
      memset(g_NVRAMData.m_aOwners, 0, sizeof(g_NVRAMData.m_aOwners));
      // Сброс глобальных переменных связанных с каналами обратной связи
      memset(g_NVRAMData.m_aTagVariables, 0, sizeof(g_NVRAMData.m_aTagVariables));
      // Сброс глобальных переменных связанных с каналами управления
      memset(g_NVRAMData.m_aChannelVariables, 0, sizeof(g_NVRAMData.m_aChannelVariables));

      // Запись данных для бутлоадера
      g_NVRAMData.m_Common.m_u8FirmwareID = EXAMPLE_ID;
      g_NVRAMData.m_Common.m_u8Mode = BOOTLOADER_MODE_RUN;
      
      g_NVRAM.Save();
   }
   
   // Загрузка локального идентификатора
   m_Address = g_NVRAMData.m_Common.m_u8LID;
   
   // Корректировка имени
   //SetValidEndByUTF8(g_EEPROM.m_Common.m_szDeviceName, sizeof(g_EEPROM.m_Common.m_szDeviceName), sizeof(g_EEPROM.m_Common.m_szDeviceName));
      
   // Генерация идентификатора
   GenerateHWID();
   
   // Инициализация шины
   g_ExtCAN.SetInBuffer(g_aCANInBuffer, sizeof(g_aCANInBuffer));
   g_ExtCAN.SetOutBuffer(g_aCANOutBuffer, sizeof(g_aCANOutBuffer));
   
   // Связывание 
   CAN_Init(0, &hcan, &g_ExtCAN);
   
   // Установка фильтров
   g_u16CANID = GetCRC16Modbus(1, (u8*)g_pszHWID, sizeof(g_pszHWID));
   CAN_SetFilter(0, g_u16CANID, m_Address);

   // Отправка информации об устройстве
   if(GetSearchInfo(l_Search))
      SendSearchResponse(GetTID(), l_Search);
}

/**
   Основной цикл работы устройства
   на входе    :  *
   на выходе   :  *
*/
void CDevice::Loop()
{
   // обработка нажатий
   WorkInputs();
   
   // Запись во внешний CAN порт
   //WriteToExtCan();

   // Чтение и обработка данных с внешнего CAN порта
   ReadFromExtCan();
}

/**
   Цикл обработки нажатий
   на входе    :  *
   на выходе   :  *
*/
void CDevice::WorkInputs()
{

#if MAX_INPUTS != 0

   universal_value_t l_Val;
   iridium_search_info_t l_Search;
   // Обработка нажатий
   IO_UpdateInput(g_aInputs, sizeof(g_aInputs) / sizeof(g_aInputs[0]));

   // Если была нажата набортная кнопка, пошлем в шину информацию о себе
   if(g_aInputs[ONBOARD_BUTTON_INDEX].m_Flags.m_bChange && g_aInputs[ONBOARD_BUTTON_INDEX].m_Flags.m_bCurValue)
   {
      // Получение информации об устройстве
      if(GetSearchInfo(l_Search))
      {
         // Отправка информации в шину
         SendSearchResponse(GetTID(), l_Search);
      }
   }

   // Обработка дискретных входов
   for(u8 i = 0; i < MAX_INPUTS; i++)
   {
      // Получение значения у учетом инвертирования значения
      bool l_bValue = g_aInputs[i].m_Flags.m_bCurValue;
      bool l_bOld = g_aInputData[i].m_Flags.m_bOldValue;
      u8 l_u8Press = TAG_PRESS_1 + i * 2 - 1;
      u8 l_u8Long = l_u8Press + 1;

      // Прямое управление
      if(g_aInputData[i].m_u8Mode == BUTTON_MODE_DIRECT)
      {
         // Подготовка значения
         l_Val.m_bValue = l_bValue;

         // Проверка изменения значения
         if(l_bValue != l_bOld)
         {
            // Если было длительное удержание, сбросим длинное удержание
            if(g_aInputData[i].m_Flags.m_bSendLong && !l_bValue)
               ChangeVariable(g_aTagsVariable[l_u8Long], IVT_BOOL, l_Val);

            // Отправка значения в шину при коротком нажатии
            ChangeVariable(g_aTagsVariable[l_u8Press], IVT_BOOL, l_Val);
            // Сбросим флаг отправки значения долгого удержания
            g_aInputData[i].m_Flags.m_bSendLong = false;
            // Запомним значение
            g_aInputData[i].m_Flags.m_bOldValue = l_bValue;
         } else
         {
            // Проверка на долгое удержание
            if(!g_aInputData[i].m_Flags.m_bSendLong && l_bValue && g_aInputs[i].m_u32ChangeTime && (HAL_GetTick() - g_aInputs[i].m_u32ChangeTime) > g_aInputData[i].m_u16Delay)
            {
               // Отправка значения в шину при долгом удержании
               ChangeVariable(g_aTagsVariable[l_u8Long], IVT_BOOL, l_Val);
               // Установим флаг отправки значения долгого удержания
               g_aInputData[i].m_Flags.m_bSendLong = true;
            }
         }
      // Тригерное управление
      } else if(g_aInputData[i].m_u8Mode == BUTTON_MODE_TRIGGER)
      {
         // Проверка изменения значения
         if(l_bValue != l_bOld)
         {
            // Запомним текущее значение
            g_aInputData[i].m_Flags.m_bOldValue = l_bValue;
            // Коррекция входа, по нажатию или по отжатию
            l_bValue ^= g_aInputData[i].m_Flags.m_bMode;
            if(l_bValue)
            {
               g_aInputData[i].m_Flags.m_bPressValue ^= 1;
               // Отправка значения в шину при коротком нажатии
               l_Val.m_bValue = g_aInputData[i].m_Flags.m_bPressValue;
               ChangeVariable(g_aTagsVariable[l_u8Press], IVT_BOOL, l_Val);
               // Сбросим флаг отправки значения долгого удержания
               g_aInputData[i].m_Flags.m_bSendLong = false;
            }
         } else
         {
            // Проверка на долгое удержание
            if(!g_aInputData[i].m_Flags.m_bSendLong && l_bValue && g_aInputs[i].m_u32ChangeTime && (HAL_GetTick() - g_aInputs[i].m_u32ChangeTime) > g_aInputData[i].m_u16Delay)
            {
               g_aInputData[i].m_Flags.m_bHoldValue ^= 1;
               // Отправка значения в шину при долгом удержании
               l_Val.m_bValue = g_aInputData[i].m_Flags.m_bHoldValue;
               ChangeVariable(g_aTagsVariable[l_u8Long], IVT_BOOL, l_Val);
               // Установим флаг отправки значения долгого удержания
               g_aInputData[i].m_Flags.m_bSendLong = true;
            }
         }
      }
   }

#endif

}

/**
   Изменение значения глобальной переменной
   на входе    :  in_u16Variable - идентификатор изменяемой переменной
                  in_u8Type      - тип переменной
                  in_rValue      - ссылка на данные значения
   на выходе   :  *
*/
void CDevice::ChangeVariable(u16 in_u16Variable, u8 in_u8Type, universal_value_t& in_rValue)
{
   // Отправка значения на шину
   SendSetVariableRequest(in_u16Variable, in_u8Type, in_rValue);
   // Изменение значения
   SetVariable(in_u16Variable, in_u8Type, in_rValue, IRIDIUM_FLAGS_END);
}

/**
   Обработка внешнего порта
   на входе    :  *
   на выходе   :  *
*/
void CDevice::ReadFromExtCan()
{
   // Поиск пакета в буфере
   void* l_pBuffer = NULL;
   size_t l_stSize = 0;
   bool l_bResult = false;
   
   // Получение указателя на данные порта
   CCANPort* l_pPort = &g_ExtCAN;//GetCANPort(&hcan);
   if(l_pPort)
   {
      // Чтение входящих сообщений
      HAL_CAN_Receive_IT(&hcan, CAN_FIFO0); 

      // Получение пакета
      l_bResult = l_pPort->GetPacket(l_pBuffer, l_stSize);
      
      // Блокирование доступа к порту
      //LockCANPort(&hcan);
      // Удаление обработанных пакетов
      l_pPort->Flush();
      // Разблокирование доступа к порту
      //UnLockCANPort(&hcan);
      
      // Проверка наличия данных
      if(l_bResult)
      {
         // Установка данных буфера
         m_InBuffer.SetBuffer(l_pBuffer, l_stSize);
   
