iRidium-Mobile/BUS77-SDK/Application/STM32/STM32F103C8T6/Example/Template/Firmware/iRidiumDevice/CDevice.cpp
         // Обрабатывать входящий поток пока исходящий буфер не заполнен на половину
         if(m_InBuffer.OpenPacket() > 0)
         {
            iridium_packet_header_t* l_pPH = m_InBuffer.GetPacketHeader();
      
            u8* l_pPacketPtr = (u8*)m_InBuffer.GetMessagePtr();
            size_t l_stPacketSize = m_InBuffer.GetMessageSize();
      
#if defined(IRIDIUM_ENABLE_CIPHER)
            // Декодирование сообщения
            if(DecodeMessage(l_pPH->m_Flags.m_u3Crypt, l_pPacketPtr, l_stPacketSize))
#endif
            {
               // Обработка сообщения
               ProcessMessage(l_pPH, l_pPacketPtr, l_stPacketSize);
            }
            // Закрытие шинного сообщения
            m_InBuffer.ClosePacket();
         }
         
         // Обработка полученого пакета
         l_pPort->DeletePacket();
      }
   }
}

/**
   Обработка внешнего порта
   на входе    :  *
   на выходе   :  *
*//*
void CDevice::WriteToExtCan()
{
   // Получение указателя на данные порта
   CCANPort* l_pPort = GetCANPort(&hcan);
   if(l_pPort)
   {
      // Получим фрейм для отправки в CAN
      can_frame_t* l_pPtr = l_pPort->GetFrame();
      if(l_pPtr)
      {
         // Установим расширенный размер кадра
         hcan.pTxMsg->IDE = CAN_ID_EXT;
      
         // Назначаем идентификатор сообщения
         hcan.pTxMsg->ExtId = l_pPtr->m_u32ExtID;
      
         // Указываем длинну сообщения
         hcan.pTxMsg->DLC = l_pPtr->m_u8Size;
      
         // Копируем данные для отправки
         memcpy(hcan.pTxMsg->Data, l_pPtr->m_aData, l_pPtr->m_u8Size);
      
         // Отправляем данные
         if(HAL_CAN_Transmit_IT(&hcan) == HAL_OK)
            l_pPort->DeleteFrame();
      }
   }
}*/

/**
   Получение значения канала управления
   на входе    :  in_u32ChannelID   - идентиифкатор канала управления
                  out_rType         - ссылка на переменную куда нужно тип значения канала управления
                  out_rValue        - ссылка на переменную куда нужно поместить значение канала управления
   на выходе   :  успешность получения значения
*/
bool CDevice::GetChannelValue(u32 in_u32ChannelID, u8& out_rType, universal_value_t& out_rValue)
{
   bool l_bResult = true;

   switch(in_u32ChannelID)
   {
      // Системный канал с именем устройства
      case CHANNEL_NAME:
         out_rType = IVT_STRING8;
         out_rValue.m_Array.m_pPtr = g_NVRAMData.m_Common.m_szDeviceName;
         out_rValue.m_Array.m_stSize = strlen((char*)out_rValue.m_Array.m_pPtr);
         break;

      // Системный канал с PIN кодом
      case CHANNEL_PIN:
         out_rType = IVT_U32;
         out_rValue.m_u32Value = g_NVRAMData.m_Common.m_u32PIN;
         break;

      // Системный канал для перезагрузки контроллера
      case CHANNEL_REBOOT:
         out_rType = IVT_BOOL;
         out_rValue.m_bValue = false;
         break;

      // Системный канал для перезагрузки контроллера
      case CHANNEL_TEST:
         out_rType = IVT_U8;
         out_rValue.m_u8Value = 0;//g_u8Test;
         break;

      // Значение не найдено
      default:
         l_bResult = false;
         break;
   }

   return l_bResult;
}

/**
   Получение значения канала обратной связи
   на входе    :  in_u32TagID - идентификатор канала обратной связи
                  out_rType   - ссылка на переменную куда нужно тип значения канала обратной связи
                  out_rValue  - ссылка на переменную куда нужно поместить значение канала обратной связи
   на выходе   :  успешность получения значения
*/
bool CDevice::GetTagValue(u32 in_u32TagID, u8& out_rType, universal_value_t& out_rValue)
{
   bool l_bResult = true;

   switch(in_u32TagID)
   {
   case TAG_ERROR:
      out_rType = IVT_U8;
      out_rValue.m_u8Value = 0;
      break;

   case TAG_TEST:
      out_rType = IVT_U8;
      out_rValue.m_u8Value = 0;//g_u8Test;
      break;

   default:
      l_bResult = false;
      break;
   }

   return l_bResult;
}

/**
   Вызов инициализации устройства
   на входе    :  *
   на выходе   :  *
*/
void iRidiumDevice_InitEEPROM()
{
   // Установка границ энергонезависимой памяти
   g_NVRAM.SetFlashRange(EEPROM_FLASH_START, EEPROM_FLASH_END);

   g_NVRAM.SetCache(&g_NVRAMData, sizeof(g_NVRAMData));
   g_NVRAM.SetUpdateTime(500);
   
   // Инициализация энергонезависимой памяти
   g_NVRAM.Init();
}

/**
   Вызов настройки устройства
   на входе    :  *
   на выходе   :  *
*/
void iRidiumDevice_Setup()
{
   // Инициализация энергонезависимой памяти
   iRidiumDevice_InitEEPROM();

   // Индикация рабочего режима
   g_Indicator.SetMode(INDICATOR_MODE_WORK);

   // Инициализация устройства
   g_Device.Setup();
}

/**
   Вызов основного цикла устройства
   на входе    :  *
   на выходе   :  *
*/
void iRidiumDevice_Loop()
{
   // Обработка индиктора
   g_Indicator.Work();

   // Обработка энергонезависимой памяти
   g_NVRAM.Work();

   // Обработка устройства
   g_Device.Loop();
}
